In [38]:
import pandas as pd

In [39]:
frame = pd.DataFrame({'Number':range(10), 'Value':['abs']*10})

In [40]:
frame

   Number Value
0       0   abs
1       1   abs
2       2   abs
3       3   abs
4       4   abs
5       5   abs
6       6   abs
7       7   abs
8       8   abs
9       9   abs

In [41]:
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [42]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [43]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [44]:
frame.shape

(6, 4)

In [45]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}

In [110]:
frame = frame.append(new_line, ignore_index=True)

In [111]:
frame

              Name                Birth       City      Position
0      Иванов А.А.  1980-03-22 00:00:00     Москва  разнорабочий
1     Сорокин И.В.  1965-07-08 00:00:00  Волгоград       инженер
2       Белов М.М.  1980-02-13 00:00:00     Ростов      менеджер
3  Мельникова Д.С.  1985-04-15 00:00:00     Ростов  разнорабочий
4      Рыбина Е.П.  1985-11-19 00:00:00     Москва       инженер
5     Костров С.О.  1985-05-31 00:00:00     Москва        стажер
6            Perov           22.03.1990      Penza           NaN

In [112]:
frame['IsStudent'] = [False]*5 + [True]*2

In [113]:
frame

              Name                Birth       City      Position IsStudent
0      Иванов А.А.  1980-03-22 00:00:00     Москва  разнорабочий     False
1     Сорокин И.В.  1965-07-08 00:00:00  Волгоград       инженер     False
2       Белов М.М.  1980-02-13 00:00:00     Ростов      менеджер     False
3  Мельникова Д.С.  1985-04-15 00:00:00     Ростов  разнорабочий     False
4      Рыбина Е.П.  1985-11-19 00:00:00     Москва       инженер     False
5     Костров С.О.  1985-05-31 00:00:00     Москва        стажер      True
6            Perov           22.03.1990      Penza           NaN      True

In [50]:
frame.drop([5, 6], axis = 0, inplace=True)

In [51]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False

In [52]:
frame.drop('IsStudent', axis=1, inplace=True)

In [60]:
frame.to_csv('updated_dataset.csv', sep=',', header=True, index=None)

In [61]:
!cat updated_dataset.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер

In [63]:
frame = pd.read_csv('dataset.tsv', sep='\t', header=0)

In [72]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [73]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [74]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [75]:
frame.fillna('разнорабочий', inplace=True)

In [76]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [80]:
frame[['Position']]

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер
5        стажер

In [81]:
frame[['Position', 'Birth', 'City']]

       Position      Birth       City
0  разнорабочий 1980-03-22     Москва
1       инженер 1965-07-08  Волгоград
2      менеджер 1980-02-13     Ростов
3  разнорабочий 1985-04-15     Ростов
4       инженер 1985-11-19     Москва
5        стажер 1985-05-31     Москва

In [83]:
frame[1:]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [99]:
import numpy as np

In [100]:
x = [2, 3, 4, 6]
y = np.array(x)

In [101]:
x

[2, 3, 4, 6]

In [102]:
print y

[2 3 4 6]

In [103]:
matrix = [[1,1,23,3,4,4], [4,5,6,7,8,3,5,5,6,6]]

In [104]:
nd_array = np.array(matrix)

In [108]:
nd_array[1][2]

6